MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0c1/thirdparty/mspm0c1/ti/devices/msp/peripherals/hw_uart.h
/* UART_ADDR Bits */
/* UART_ADDR[VALUE] Bits */
#define UART_ADDR_VALUE_OFS                      (0)                             /* !< VALUE Offset */
#define UART_ADDR_VALUE_MASK                     ((uint32_t)0x000000FFU)         /* !< Self Address for 9-Bit Mode  This
                                                                                    field contains the address that
                                                                                    should be matched when UARTxAMASK is
                                                                                    FFh. */
#define UART_ADDR_VALUE_MINIMUM                  ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UART_ADDR_VALUE_MAXIMUM                  ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* UART_CLKDIV2 Bits */
/* UART_CLKDIV2[RATIO] Bits */
#define UART_CLKDIV2_RATIO_OFS                   (0)                             /* !< RATIO Offset */
#define UART_CLKDIV2_RATIO_MASK                  ((uint32_t)0x00000007U)         /* !< Selects divide ratio of module
                                                                                    clock */
#define UART_CLKDIV2_RATIO_DIV_BY_1              ((uint32_t)0x00000000U)         /* !< Do not divide clock source */
#define UART_CLKDIV2_RATIO_DIV_BY_2              ((uint32_t)0x00000001U)         /* !< Divide clock source by 2 */
#define UART_CLKDIV2_RATIO_DIV_BY_3              ((uint32_t)0x00000002U)         /* !< Divide clock source by 3 */
#define UART_CLKDIV2_RATIO_DIV_BY_4              ((uint32_t)0x00000003U)         /* !< Divide clock source by 4 */
#define UART_CLKDIV2_RATIO_DIV_BY_5              ((uint32_t)0x00000004U)         /* !< Divide clock source by 5 */
#define UART_CLKDIV2_RATIO_DIV_BY_6              ((uint32_t)0x00000005U)         /* !< Divide clock source by 6 */
#define UART_CLKDIV2_RATIO_DIV_BY_7              ((uint32_t)0x00000006U)         /* !< Divide clock source by 7 */
#define UART_CLKDIV2_RATIO_DIV_BY_8              ((uint32_t)0x00000007U)         /* !< Divide clock source by 8 */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_uart__include */
